# Handling multiple criteria with AND/OR
---

## **Excel:**

    =AND(logical1, [logical2], ...)
    =OR(logical1, [logical2], ...)
    
<br>

## **Python:**

**AND**

    (logical1) & (logical2) & (...)

**OR**

    (logical1) | (logical2) | (...)

<br>

### Load required packages and data
---

In [1]:
# Import required packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# Save Github location paths to a variable
failed_bank_path = 'https://github.com/The-Calculated-Life/python_analysis_for_excel/blob/main/data/failed_banks.xlsx?raw=true'
bx_books_path = 'https://raw.githubusercontent.com/The-Calculated-Life/python_analysis_for_excel/main/data/bx_books.csv'

# Read excel and CSV files
bank_detail = pd.read_excel(failed_bank_path, sheet_name='detail')
bank_list = pd.read_excel(failed_bank_path, sheet_name='banks')
bx_books = pd.read_csv(bx_books_path)

<br>

### Examples: AND (&)
---

In [3]:
# How many failed banks had an estimated loss over $50,000 with less than $150,000 in assets? (logical1)
bank_detail['ESTIMATED LOSS'] > 50000

0      False
1      False
2      False
3      False
4      False
       ...
574    False
575    False
576    False
577    False
578    False
Name: ESTIMATED LOSS, Length: 579, dtype: bool

<br>

In [4]:
# How many failed banks had an estimated loss over $50,000 with less than $150,000 in assets? (logical2)
bank_detail['ASSETS'] < 150000

0      False
1       True
2       True
3       True
4       True
       ...
574     True
575     True
576     True
577     True
578     True
Name: ASSETS, Length: 579, dtype: bool

<br>

In [5]:
# How many failed banks had an estimated loss over $50,000 with less than $150,000 in assets? (both)
(bank_detail['ESTIMATED LOSS'] > 50000) & (bank_detail['ASSETS'] < 150000)

0      False
1      False
2      False
3      False
4      False
       ...
574    False
575    False
576    False
577    False
578    False
Length: 579, dtype: bool

<br>

In [6]:
# How many failed banks had an estimated loss over $50,000 with less than $150,000 in assets? (final)
bank_detail[(bank_detail['ESTIMATED LOSS'] > 50000) & (bank_detail['ASSETS'] < 150000)]

      CERT      FIN     CHARTER  ESTIMATED LOSS  ASSETS  DEPOSITS RESOLUTION
435  34485  10102.0  COMMERCIAL         52679.0  119529    110362    FAILURE
463  57667  10079.0  COMMERCIAL         52700.0  118601    115478    FAILURE
533  57654  10016.0  COMMERCIAL         56318.0  112368     98934    FAILURE
565   8966   4652.0       OTHER         63600.0   72267     60168    FAILURE

<br>

In [7]:
# Helpful tip: Saving logicals as variables
is_large_loss = bank_detail['ESTIMATED LOSS'] > 50000
small_assets = bank_detail['ASSETS'] < 150000

bank_detail[is_large_loss & small_assets]

      CERT      FIN     CHARTER  ESTIMATED LOSS  ASSETS  DEPOSITS RESOLUTION
435  34485  10102.0  COMMERCIAL         52679.0  119529    110362    FAILURE
463  57667  10079.0  COMMERCIAL         52700.0  118601    115478    FAILURE
533  57654  10016.0  COMMERCIAL         56318.0  112368     98934    FAILURE
565   8966   4652.0       OTHER         63600.0   72267     60168    FAILURE

<br><br>
**QUICK CHALLENGE #1:**

**Task: Write code which selects the rows for books published in 2002 by the publisher "Oxford University Press" in the `bx_books` dataframe**

In [8]:
# Your code for quick challenge #1 here:
pub_2002 = bx_books['year_of_publication'] == 2002
is_oxford = bx_books['publisher'] == "Oxford University Press"

bx_books[pub_2002 & is_oxford]

             isbn  ...                publisher
0       195153448  ...  Oxford University Press
17138   195154991  ...  Oxford University Press
28236   192831879  ...  Oxford University Press
30440   965444333  ...  Oxford University Press
33704   192834681  ...  Oxford University Press
...           ...  ...                      ...
250176  195152549  ...  Oxford University Press
254379  195417313  ...  Oxford University Press
261461  198605617  ...  Oxford University Press
261582  195128737  ...  Oxford University Press
266115  192802526  ...  Oxford University Press

[66 rows x 5 columns]

<br><br>

### Example: OR (|)
---

In [9]:
# View "bank_list" dataframe
bank_list.head()

    CERT  ... Closing Date
0  14361  ...   2020-04-03
1  18265  ...   2020-02-14
2  21111  ...   2019-11-01
3  58317  ...   2019-10-25
4  58112  ...   2019-10-25

[5 rows x 6 columns]

<br>

In [10]:
# How many bank failures have there been in the city of Newark OR in the state of Ohio (OH)? (is_newark)
is_newark = bank_list['City'] == 'Newark'

<br>

In [11]:
# How many bank failures have there been in the city of Newark OR in the state of Ohio (OH)? (is_ohio)
is_ohio = bank_list['ST'] == 'OH'

<br>

In [12]:
# How many bank failures have there been in the city of Newark OR in the state of Ohio (OH) (used both conditions)
bank_list[is_newark | is_ohio]

      CERT  ... Closing Date
2    21111  ...   2019-11-01
3    58317  ...   2019-10-25
37   32284  ...   2014-05-23
245  27808  ...   2010-09-17
338  18806  ...   2010-03-19
381  29776  ...   2009-12-04
442  32288  ...   2009-07-31
534  16848  ...   2007-10-04
540  31330  ...   2004-02-14
552   8966  ...   2002-02-01
557   6629  ...   2001-05-03

[11 rows x 6 columns]

<br><br>
**QUICK CHALLENGE #2:**

**Task: Write code which selects the rows for books published in 2002 OR books which were written by "Plato" from the `bx_books` dataframe**

In [13]:
# Your code for quick challenge #2 here:
pub_2002

0          True
1         False
2         False
3         False
4         False
          ...
271374    False
271375    False
271376    False
271377    False
271378    False
Name: year_of_publication, Length: 271379, dtype: bool

In [14]:
is_plato = bx_books['book_author'] == 'Plato'

In [15]:
bx_books[pub_2002 | is_plato]

              isbn  ...                      publisher
0        195153448  ...        Oxford University Press
9       074322678X  ...                       Scribner
32      3404921038  ...                       LÃ?Â¼bbe
38       449005615  ...               Ballantine Books
47       425182908  ...       Berkley Publishing Group
...            ...  ...                            ...
271337   375415343  ...                          Knopf
271338  3404204433  ...                       LÃ?Â¼bbe
271356   971854823  ...               Life Works Books
271369   762412119  ...  Running Press Book Publishers
271377   192126040  ...        Oxford University Press

[17665 rows x 5 columns]

In [ ]:
/